app/Http/Livewire/LopiComponent.php

    public function getRankAndClicks()
    {
        return [
            'rank' => auth()->user()->placeInLeaderboard ?? null,
            'user_clicks' => auth()->user()?->clicks->count() ?? 0,
            'total_clicks' => Click::count(),
        ];
---
select count(*) as aggregate from `clicks`

    public function click()
    {
        Click::create([
            'user_id' => auth()->user()?->id,
            'ip' => request()->ip(),
            'user_agent' => request()->userAgent(),
        ]);
---
insert into `clicks` (`user_id`, `ip`, `user_agent`, `updated_at`, `created_at`) values (51, '127.0.0.1', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/111.0.0.0 Safari/537.36', '2023-03-25 21:50:05', '2023-03-25 21:50:05')